app/views/devise/registrations/edit.html.erb

        <p>
          <%= @user.roles.first.name.titleize %>
---
SELECT "roles".* FROM "roles" INNER JOIN "users_roles" ON "roles"."id" = "users_roles"."role_id" WHERE "users_roles"."user_id" = 5 LIMIT 1