app/views/invoices/_form.html.erb

SELECT "accounts".* FROM "accounts" WHERE "accounts"."id" = 1 LIMIT 1
SELECT "clients".* FROM "clients" WHERE "clients"."account_id" = 1 ORDER BY first_name
---
    <div class="form-inputs">
      <%= f.association :client, collection: current_user.account.clients.all(order: 'first_name'), label_method: :full_name, :required => true %>