app/views/visit_blocks/_form.html.erb

        <%= f.label :client_prices_id, 'Service Type', class: 'inline' %>
        <%= f.grouped_collection_select :client_prices_id, current_user.account.clients.order(:last_name), :client_prices, :last_name, :id, :visit_type,  include_blank: true %>
---
SELECT "clients".* FROM "clients" WHERE "clients"."account_id" = 70 ORDER BY last_name