app/controllers/clients_controller.rb

SELECT "accounts".* FROM "accounts" WHERE "accounts"."id" = 1 LIMIT 1
SELECT "clients".* FROM "clients" WHERE "clients"."account_id" = 1 ORDER BY last_name asc LIMIT 10 OFFSET 0
---
  def index
    @clients = current_user.account.clients.search(params[:search]).order(sort_column + " " + sort_direction).paginate(:per_page => 10, :page => params[:page])

INSERT INTO "clients" ("account_id", "active", "additional_notes", "address_1", "address_2", "cell_phone", "city", "created_at", "email", "emergency_phone", "first_name", "gmaps", "last_name", "latitude", "longitude", "phone_number", "security_code", "state", "updated_at", "user_id", "zip") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @client = Client.new(params[:client])

    respond_to do |format|
      if @client.save

SELECT "clients".* FROM "clients" WHERE "clients"."id" = ? LIMIT 1  [["id", "9"]]
DELETE FROM "clients" WHERE "clients"."id" = ?  [["id", 9]]
---
  def destroy
    @client = Client.find(params[:id])
    @client.destroy