app/controllers/pets_controller.rb

  def create
    @pet = Pet.new(params[:pet])
    @client = @pet.client

    respond_to do |format|
      if @pet.save
---
INSERT INTO "pets" ("active", "animal_name", "birthdate", "breed", "client_id", "color", "created_at", "fixed", "notes", "pet_type", "sex", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)

  def update
    @pet = Pet.find(params[:id])

    respond_to do |format|
      if @pet.update_attributes(params[:pet])
---
SELECT "pets".* FROM "pets" WHERE "pets"."id" = ? LIMIT 1  [["id", "4"]]
UPDATE "pets" SET "birthdate" = '2014-03-22 12:00:00.000000', "updated_at" = '2014-03-20 14:30:35.831445' WHERE "pets"."id" = 4