app/controllers/prints_controller.rb

  def index
    if current_user.has_role? :admin or current_user.has_role? :default or current_user.has_role? :basic or current_user.has_role? :standard or current_user.has_role? :plus or current_user.has_role? :advanced or current_user.has_role? :premier
      @print_visits = current_user.visits.where(['"visit_date" >= (:week_start) AND "visit_date" < (:weekend)', {week_start: Chronic.parse("Last week's Sunday midnight"), weekend: Chronic.parse("This week's Sunday")}]).order(:visit_date)
      @admin_visits = current_user.account.visits.where(['"visit_date" >= (:week_start) AND "visit_date" < (:weekend)', {week_start: Chronic.parse("Last week's Sunday midnight"), weekend: Chronic.parse("This week's Sunday")}]).order(:visit_date)
---
SELECT "visits".* FROM "visits" WHERE "visits"."user_id" = 9 AND ("visit_date" >= ('2014-07-10 00:00:00.000000') AND "visit_date" < ('2014-07-16 01:33:55.960653')) AND ("visit_date" = "sunday")
SELECT "visits".* FROM "visits" INNER JOIN "clients" ON "visits"."client_id" = "clients"."id" WHERE "clients"."account_id" = 70 AND ("visit_date" >= ('2014-07-07 00:00:00.000000') AND "visit_date" < ('2014-07-13 12:00:00.000000')) ORDER BY visit_date
SELECT COUNT(*) FROM "visits" WHERE "visits"."user_id" = 9 AND (visit_date >= ('2014-07-08 19:30:00.000000') AND visit_date < ('2014-07-15 15:48:22.334734'))