app/controllers/registrations_controller.rb

  def update
    # required for settings form to submit when password is left blank
    if params[:user][:password].blank?
      params[:user].delete("password")
      params[:user].delete("password_confirmation")
    end

    @user = User.find(current_user.id)
---
SELECT "users".* FROM "users" WHERE "users"."id" = 9 LIMIT 1

  def new
    @plan = params[:plan]
    @account = Account.create(params[:account])
---
INSERT INTO "accounts" ("created_at", "name", "updated_at") VALUES (?, ?, ?)  [["created_at", Mon, 24 Feb 2014 22:31:55 UTC +00:00], ["name", nil], ["updated_at", Mon, 24 Feb 2014 22:31:55 UTC +00:00]]