app/controllers/visits_controller.rb

SELECT "visits".* FROM "visits" INNER JOIN "clients" ON "visits"."client_id" = "clients"."id" WHERE "clients"."account_id" = 1 AND (visit_date > '2014-02-23 05:00:00') AND (end_time < '2014-04-06 04:00:00')
---
  def index
    if current_user.has_role? :admin or current_user.has_role? :default or current_user.has_role? :basic or current_user.has_role? :standard or current_user.has_role? :plus or current_user.has_role? :advanced or current_user.has_role? :premier
      @visits = current_user.account.visits.scoped
      @print_visits = current_user.visits.where(['"visit_date" >= (:week_start) AND "visit_date" < (:weekend)', {week_start: Chronic.parse("Last week's Sunday midnight"), weekend: Chronic.parse("This week's Sunday")}]).order(:visit_date)

SELECT "visits".* FROM "visits" WHERE "visits"."id" = ? LIMIT 1  [["id", "print_week"]]
---
  def show
    @visit = Visit.find(params[:id])

SELECT "visits".* FROM "visits" WHERE "visits"."id" = ? LIMIT 1  [["id", "8"]]
DELETE FROM "visits" WHERE "visits"."id" = ?  [["id", 8]]
---
  def destroy
    @visit = Visit.find(params[:id])
    @visit.destroy