app/controllers/visit_blocks_controller.rb

INSERT INTO "visit_blocks" ("client_id", "created_at", "friday", "monday", "saturday", "sunday", "thursday", "tuesday", "updated_at", "user_id", "visit_date_end", "visit_date_start", "visit_price", "visit_time", "visit_type", "wednesday") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
INSERT INTO "visits" ("client_id", "created_at", "end_time", "invoice_id", "updated_at", "user_id", "visit_block_id", "visit_date", "visit_price", "visit_type") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @visit_block = VisitBlock.new(params[:visit_block])

    respond_to do |format|
      if @visit_block.save